# kitchen sink

cask_args appdir: '/Applications'
tap 'caskroom/cask'

cask 'firefox'
cask 'google-chrome'
brew 'Caskroom/versions/google-chrome-canary'

cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'xquartz'

brew 'readline'
brew 'gnutls'
brew 'librsvg'
brew 'imagemagick'
brew 'freetype'
brew 'fontconfig'
brew 'berkeley-db4'

# emacs
tap 'd12frosted/emacs-plus'
brew 'emacs-plus'
brew 'ispell'
brew 'isync'
brew 'pandoc'
brew 'ditaa'
brew 'mu', args: [ '--with-emacs' ]
brew 'notmuch', args: [ '--with-emacs' ]
brew 'msmtp', args: [ '--with-emacs' ]

cask 'clipmenu'
cask 'gpgtools'
cask 'slack'
cask 'hipchat'
cask 'virtualbox'
cask 'vagrant'
cask 'screenhero'
cask 'kube-solo'
cask 'corectl-app'
cask 'iterm2'

brew 'macvim'

cask 'atom'

brew 'groovy'
brew 'node'
brew 'go'

brew 'postgresql'
brew 'influxdb'
brew 'redis'
brew 'sqlite'

# rubby
brew 'ruby-build'
brew 'rbenv'

# shell stuff
brew 'zsh'
brew 'fortune'
brew 'coreutils'
brew 'figlet'
brew 'mtr'
brew 'nmap'
brew 'tmux'
brew 'watch'
brew 'htop-osx'

brew 'curl'
brew 'wget'
brew 'w3m'
cask 'opera'

brew 'markdown'
brew 'kwm'
brew 'nginx'
brew 'tig'
brew 'docker'

cask 'wireshark'
cask 'inkscape'
cask 'karabiner'
cask 'the-unarchiver'
cask 'kindle'
cask 'github-desktop'
cask 'skitch'
cask 'licecap'
cask 'vlc'
cask 'smcfancontrol'
cask 'sequel-pro'
cask 'skype'
cask 'flux'
cask 'monodraw'

mas 'Growl', id: 467939042
mas 'Airmail 3', id: 918858936
