# kitchen sink

cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/dupes'

# tap 'github/bootstrap'
# brew bootstrap-rbenv-ruby
# brew bootstrap-nodeenv-node

brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'

cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'xquartz'

brew 'berkeley-db4'
brew 'fontconfig'
brew 'freetype'
brew 'gnutls'
brew 'imagemagick'
brew 'librsvg'
brew 'readline'

brew 'ruby-build'
brew 'rbenv'

brew 'groovy'
brew 'node'
brew 'go'

brew 'influxdb'
brew 'postgresql'
brew 'redis'
brew 'sqlite'

# shell stuff
brew 'zsh'
brew 'zsh-completions'
brew 'bash'
brew 'coreutils'
brew 'figlet'
brew 'findutils'
brew 'fortune'
brew 'htop-osx'
brew 'markdown'
brew 'mtr'
brew 'nginx'
brew 'nmap'
brew 'psutils'
brew 'tig'
brew 'tmux'
brew 'watch'

brew 'curl'
brew 'w3m'
brew 'wget'

# fonts
tap 'caskroom/fonts'
cask 'font-profontx'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# emacs
tap 'd12frosted/emacs-plus'
brew 'emacs-plus'
brew 'ispell'
brew 'isync'
brew 'pandoc'
brew 'ditaa'
brew 'mu', args: [ '--with-emacs' ]
brew 'notmuch', args: [ '--with-emacs' ]
brew 'msmtp', args: [ '--with-emacs' ]

brew 'macvim'
cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'chicken'
cask 'clipmenu'
cask 'cord'
cask 'corectl-app'
cask 'dash'
brew 'docker'
cask 'fluid'
cask 'flux'
cask 'github-desktop'
cask 'gpgtools'
cask 'hipchat'
cask 'imageoptim'
cask 'inkscape'
cask 'iterm2'
cask 'karabiner'
cask 'kindle'
cask 'kube-solo'
cask 'licecap'
cask 'monodraw'
cask 'omnigraffle'
cask 'opera'
cask 'quip'
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'rescuetime'
cask 'screenhero'
cask 'sequel-pro'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'smcfancontrol'
cask 'spectacle'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'wireshark'

mas 'Airmail 3', id: 918858936
mas 'Display Menu', id: 549083868 
mas 'Giphy Capture', id: 668208984
mas 'Growl', id: 467939042
mas 'Twitter', id: 409789998
